[net]
batch = 64 
subdivisions=2
width=416 
height=416 
channels=3
momentum=0.9 
decay=0.0005
angle=0 
saturation = 1.5 
exposure = 1.5 
hue = .1
learning_rate=0.001 
burn_in = 1000 
max_batches = 500200 
policy = steps 
steps=400000,450000 
scales=.1,.1

[convolutional] 
stride=1 
size=3 
filter=16 
pad=1
batch_normalize=1 
activation=leaky 

[pool]
stride=2 
size=2 


[convolutional] 
stride=1 
size=3 
filter=32 
pad=1
batch_normalize=1 
activation=leaky 

[pool]
stride=2 
size=2 


[convolutional] 
stride=1 
size=3 
filter=64 
pad=1
batch_normalize=1 
activation=leaky 

[pool]
stride=2 
size=2 


[convolutional] 
stride=1 
size=3 
filter=128 
pad=1
batch_normalize=1 
activation=leaky 

[pool]
stride=2 
size=2 


[convolutional] 
stride=1 
size=3 
filter=256 
pad=1
batch_normalize=1 
activation=leaky 

[pool]
stride=2 
size=2 


[convolutional] 
stride=1 
size=3 
filter=512 
pad=1
batch_normalize=1 
activation=leaky 

[pool]
stride=1 
size=2 


[convolutional] 
stride=1 
size=3 
filter=1024 
pad=1
batch_normalize=1 
activation=leaky 



[convolutional] 
stride=1 
size=1 
filter=256 
pad=0
batch_normalize=1 
activation=leaky 



[convolutional] 
stride=1 
size=3 
filter=512 
pad=1
batch_normalize=1 
activation=leaky 



[convolutional] 
stride=1 
size=1 
filter=255 
pad=0

[yolo] 
mask = 3,4,5 
anchors = 10,14,23,27,37,58,81,82,135,169,344,319 
classes = 80 
num = 6 
jitter=.3
ignore_thresh = .7 
truth_thresh = 1 
random = 1

[route] 
layers = -4

[convolutional] 
stride=1 
size=1 
filter=128 
pad=0
batch_normalize=1 
activation=leaky 


[upsample]
stride=2

[route] 
layers = -1,-10


[convolutional] 
stride=1 
size=3 
filter=256 
pad=1
batch_normalize=1 
activation=leaky 



[convolutional] 
stride=1 
size=1 
filter=255 
pad=0

[yolo] 
mask = 0,1,2 
anchors = 10,14,23,27,37,58,81,82,135,169,344,319 
classes = 80 
num = 6 
jitter=.3
ignore_thresh = .7 
truth_thresh = 1 
random = 1

